In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from glob import glob

In [2]:
glob("*.csv")

['TRADING_PRICE_DEMAND.csv']

In [3]:
nemdf = pd.read_csv('TRADING_PRICE_DEMAND.csv', parse_dates=["SETTLEMENTDATE"])
nemdf.head()

       SETTLEMENTDATE REGIONID    RRP  TOTALDEMAND
0 2009-01-01 00:30:00     QLD1  17.63      5611.54
1 2009-01-01 00:30:00     VIC1  16.76      4799.87
2 2009-01-01 00:30:00     NSW1  18.38      7535.00
3 2009-01-01 00:30:00      SA1  21.87      1310.89
4 2009-01-01 00:30:00     TAS1  25.20       909.71

In [4]:
nemdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 876475 entries, 0 to 876474
Data columns (total 4 columns):
SETTLEMENTDATE    876475 non-null datetime64[ns]
REGIONID          876475 non-null object
RRP               876475 non-null float64
TOTALDEMAND       876475 non-null float64
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 26.7+ MB

In [5]:
pvnem = nemdf.pivot_table(values='TOTALDEMAND', index='SETTLEMENTDATE', columns='REGIONID')
pvnem.head()

REGIONID                NSW1     QLD1      SA1    TAS1     VIC1
SETTLEMENTDATE
2009-01-01 00:30:00  7535.00  5611.54  1310.89  909.71  4799.87
2009-01-01 01:00:00  7229.24  5457.34  1272.69  896.63  4646.21
2009-01-01 01:30:00  6857.62  5294.12  1178.87  897.52  4950.16
2009-01-01 02:00:00  6535.05  5153.47  1130.78  906.22  4755.46
2009-01-01 02:30:00  6287.88  5060.33  1059.53  893.19  4545.67

In [6]:
pvnem.tail()

REGIONID                NSW1     QLD1      SA1     TAS1     VIC1
SETTLEMENTDATE
2018-12-31 22:00:00  8053.74  6663.50  1325.86  1049.19  4292.49
2018-12-31 22:30:00  8043.91  6599.79  1323.90  1061.77  4257.85
2018-12-31 23:00:00  7901.73  6511.35  1312.90  1046.08  4247.55
2018-12-31 23:30:00  7720.44  6283.71  1313.37  1022.57  4439.96
2019-01-01 00:00:00  7612.74  6104.63  1472.42  1024.83  4486.20

In [7]:
vc = pd.DataFrame(nemdf.SETTLEMENTDATE.value_counts())
vc.head()

                     SETTLEMENTDATE
2012-06-21 11:30:00               5
2010-11-02 05:30:00               5
2009-02-17 14:00:00               5
2016-12-28 22:30:00               5
2013-02-25 01:00:00               5

In [8]:
vc[vc.SETTLEMENTDATE != 5]

Empty DataFrame
Columns: [SETTLEMENTDATE]
Index: []

In [9]:
pvnem.to_csv("2009-18_NEMdemand.csv")

In [10]:
df = pd.read_csv("2009-18_NEMdemand.csv", index_col=0, parse_dates=['SETTLEMENTDATE'])
df.head()

                        NSW1     QLD1      SA1    TAS1     VIC1
SETTLEMENTDATE
2009-01-01 00:30:00  7535.00  5611.54  1310.89  909.71  4799.87
2009-01-01 01:00:00  7229.24  5457.34  1272.69  896.63  4646.21
2009-01-01 01:30:00  6857.62  5294.12  1178.87  897.52  4950.16
2009-01-01 02:00:00  6535.05  5153.47  1130.78  906.22  4755.46
2009-01-01 02:30:00  6287.88  5060.33  1059.53  893.19  4545.67

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 175295 entries, 2009-01-01 00:30:00 to 2019-01-01 00:00:00
Data columns (total 5 columns):
NSW1    175295 non-null float64
QLD1    175295 non-null float64
SA1     175295 non-null float64
TAS1    175295 non-null float64
VIC1    175295 non-null float64
dtypes: float64(5)
memory usage: 8.0 MB

In [12]:
df['NEMtotal'] = df.sum(axis=1)
df.head()

                        NSW1     QLD1      SA1    TAS1     VIC1  NEMtotal
SETTLEMENTDATE
2009-01-01 00:30:00  7535.00  5611.54  1310.89  909.71  4799.87  20167.01
2009-01-01 01:00:00  7229.24  5457.34  1272.69  896.63  4646.21  19502.11
2009-01-01 01:30:00  6857.62  5294.12  1178.87  897.52  4950.16  19178.29
2009-01-01 02:00:00  6535.05  5153.47  1130.78  906.22  4755.46  18480.98
2009-01-01 02:30:00  6287.88  5060.33  1059.53  893.19  4545.67  17846.60

In [13]:
df.to_csv("2009-18_NEMtotaldemand.csv")